In [1]:
import pandas as pd

In [2]:
titanic_train_data=pd.read_csv('C:/Users/Abdal/Desktop/Python/Jupyter/Titanic-ML from Disaster Compatition/train.csv')
titanic_test_data=pd.read_csv('C:/Users/Abdal/Desktop/Python/Jupyter/Titanic-ML from Disaster Compatition/test.csv')
test_ids=titanic_test_data["PassengerId"]

Have a look into the data

In [3]:
titanic_train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
titanic_train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
titanic_test_data.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

clean unwanted columns

In [8]:
def clean(data):
    data=data.drop(["PassengerId","Name","Ticket","Cabin"],axis=1)
    cols=['SibSp','Parch','Fare','Age',]
    for col in cols:
        data[col].fillna(data[col].median(),inplace=True)
    data.Embarked.fillna("U",inplace=True)
    return data
filtered_data=clean(titanic_train_data)
filtered_test=clean(titanic_test_data)

In [9]:
filtered_data.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

convert the string values into int

In [10]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
cols = ['Sex','Embarked']

for col in cols:
    filtered_data[col] =le.fit_transform(filtered_data[col])
    filtered_test[col] =le.transform(filtered_test[col])
    print(le.classes_)
filtered_data.describe()

['female' 'male']
['C' 'Q' 'S' 'U']

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.647587,29.361582,0.523008,0.381594,32.204208,1.538721
std,0.486592,0.836071,0.477990,13.019697,1.102743,0.806057,49.693429,0.794231
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,22.000000,0.000000,0.000000,7.910400,1.000000
50%,0.000000,3.000000,1.000000,28.000000,0.000000,0.000000,14.454200,2.000000
75%,1.000000,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,3.000000

# Now its the model part.

#1 DecisionTreeRegressor

In [11]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_absolute_error
from sklearn.model_selection import train_test_split

Selecting the targeted data:

In [12]:
y=filtered_data["Survived"]

X=filtered_data.drop("Survived",axis =1)#may change this and pick some of the columns not all of them

train_X, val_X, train_y, val_y = train_test_split(X, y,test_size=0.2, random_state = 42)

In [13]:
dtr_model=DecisionTreeRegressor()
dtr_model.fit(train_X, train_y)

DecisionTreeRegressor()

In [14]:
dtr_predictions =dtr_model.predict(val_X)

mean_absolute_error(val_y, dtr_predictions)

0.2239292364990689

Something is wronge

#2 Random Forests

In [15]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import accuracy_score
forest_model = RandomForestRegressor(random_state=1)
forest_model.fit(train_X, train_y)
forest_predictions = forest_model.predict(val_X)
print(mean_absolute_error(val_y, forest_predictions))

0.23895793259940482

Againe, same as the Decision Tree

#3 LogisticRegression

In [16]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
lg_model=LogisticRegression(random_state=1,max_iter=1000)
lg_model.fit(train_X, train_y)
lg_predictions = lg_model.predict(val_X)
accuracy_score(val_y, lg_predictions)

0.8100558659217877

Now we talk

In [17]:
submission_preds=lg_model.predict(filtered_test)

In [18]:
df=pd.DataFrame({'PassengerId':test_ids.values,
                 'Survived':submission_preds})

In [19]:
df.to_csv('C:/Users/Abdal/Desktop/Python/Jupyter/Titanic-ML from Disaster Compatition/submission.csv',index=False)